Autodesk.Revit.DB.Structure.StructuralConnectionHandler.IsDisconnectedIntentionally
Returns true if this connection was disconnected intentionally from the attached steel document counterpart
Since:
2017